cheatsheets/nyxt_cheatsheet.org
:PROPERTIES:
:ID:       3cabee80-f890-424b-85b7-63415a05a120
:END:
#+TITLE: Nyxt_cheatsheet
#+DESCRIPTION: Lispy Cheatsheet
#+TAGS:

* Categories

+ Help :: describe functions/variables
+ Move :: movement in text, find/search
+ Edit :: copy/past
+ Present :: zoom
+ History ::
+ Bookmarks ::
+ Hints :: ???
+ HTTP :: open URL, go to URL bar
+ Downloads :: navigate downloads
+ Buffers :: search/open buffers
+ Windows :: frames really
+ Lisp :: commands, repl

* Keymaps

** Application

|---------+-------------------|
| binding | function          |
|---------+-------------------|
| C-g     | nothing           |
| C-M-c   | open-inspector    |
| C-M-Z   | application-mode  |
| C-p     | print-buffer      |
| C-q     | quit              |
| C-x C-c | quit              |
| f11     | toggle-fullscreen |
|---------+-------------------|

** Help

Via =C-h=

|---------+-------------------|
| binding | function          |
|---------+-------------------|
| C-h b   | describe-bindings |
| C-h C   | describe-class    |
| C-h c   | describe-command  |
| C-h C-h | help              |
| C-h f   | describe-function |
| C-h h   | help              |
| C-h k   | describe-key      |
| C-h r   | manual            |
| C-h s   | describe-slot     |
| C-h t   | tutorial          |
| C-h v   | describe-variable |
|---------+-------------------|

Via =F1=

|---------+-------------------|
| binding | function          |
|---------+-------------------|
| f1 b    | describe-bindings |
| f1 C    | describe-class    |
| f1 c    | describe-command  |
| f1 f    | describe-function |
| f1 f1   | help              |
| f1 k    | describe-key      |
| f1 r    | manual            |
| f1 s    | describe-slot     |
| f1 t    | tutorial          |
| f1 v    | describe-variable |
|---------+-------------------|



** Move

Via =C-<arrow>=

|---------+------------------|
| binding | function         |
|---------+------------------|
| C-up    | scroll-to-top    |
| C-down  | scroll-to-bottom |
|---------+------------------|

Via =keypad=

|--------------+------------------|
| binding      | function         |
|--------------+------------------|
| keypaddown   | scroll-down      |
| keypadend    | scroll-to-bottom |
| keypadhome   | scroll-to-top    |
| keypadleft   | scroll-left      |
| keypadnext   | scroll-page-down |
| keypadpageup | scroll-page-up   |
| keypadprior  | scroll-page-up   |
| keypadright  | scroll-right     |
| keypadup     | scroll-up        |
|--------------+------------------|

Via =emacs=

|---------+------------------|
| binding | function         |
|---------+------------------|
| C-.     | jump-to-heading  |
| C-n     | scroll-down      |
| C-p     | scroll-up        |
| C-v     | scroll-page-down |
| M-<     | scroll-to-top    |
| M->     | scroll-to-bottom |
| M-v     | scroll-page-up   |
|---------+------------------|

** Edit

|-------------+---------------------------|
| binding     | function                  |
|-------------+---------------------------|
| C-i         | autofill                  |
| C-c         | copy                      |
| M-c t       | copy-title                |
| M-c l       | copy-url                  |
| C-x         | cut                       |
| C-u C-o     | edit-with-external-editor |
| M-i         | focus-first-input-field   |
| C-Z         | redo                      |
| C-a         | select-all                |
| C-z         | undo                      |
|-------------+---------------------------|

Via =emacs=

|-------------+---------------------------|
| binding     | function                  |
|-------------+---------------------------|
| M-w         | copy                      |
| C-M-i       | copy-title                |
| C-M-l       | copy-url                  |
| C-w         | cut                       |
| C-u C-x C-f | edit-with-external-editor |
| C-y         | paste                     |
| C-?         | redo                      |
| C-x h       | select-all                |
| C-/         | undo                      |
|-------------+---------------------------|

** Present

|--------------+-----------------|
| binding      | function        |
|--------------+-----------------|
| C-hyphen     | unzoom-page     |
| C-button5    | unzoom-page     |
| C-+          | zoom-page       |
| C-=          | zoom-page       |
| C-button4    | zoom-page       |
| C-0          | reset-page-zoom |
|--------------+-----------------|

Via =emacs=

|--------------+-----------------|
| binding      | function        |
|--------------+-----------------|
| C-x C-+      | zoom-page       |
| C-x C-=      | zoom-page       |
| C-x C-0      | reset-page-zoom |
| C-x C-hyphen | unzoom-page     |
|--------------+-----------------|

** History

|-----------+----------------------------|
| binding   | function                   |
|-----------+----------------------------|
| C-s-H     | history-all-query          |
| C-s-h     | history-all-query          |
| C-M-left  | history-all-query          |
| M-[       | history-backwards          |
| M-left    | history-backwards          |
| M-s-left  | history-backwards-query    |
| M-]       | history-forwards           |
| M-right   | history-forwards           |
| button9   | history-forwards           |
| C-M-right | history-forwards-all-query |
| M-s-right | history-forwards-query     |
|-----------+----------------------------|

Via =emacs=

|---------+----------------------------|
| binding | function                   |
|---------+----------------------------|
| C-M-b   | history-all-query          |
| C-b     | history-backwards          |
| button8 | history-backwards          |
| M-b     | history-backwards-query    |
| C-f     | history-forwards           |
| C-M-f   | history-forwards-all-query |
| M-f     | history-forwards-query     |
|---------+----------------------------|

** Bookmarks

|---------+----------------------|
| binding | function             |
|---------+----------------------|
| C-m C-s | bookmark-buffer-url  |
| C-m s   | bookmark-current-url |
| C-m g   | bookmark-hint        |
| C-m u   | bookmark-url         |
| C-m k   | delete-bookmark      |
| C-b     | list-bookmarks       |
|---------+----------------------|

Via =emacs=

|---------+----------------------|
| binding | function             |
|---------+----------------------|
| C-x r k | delete-bookmark      |
| C-x r u | bookmark-url         |
| C-x r m | bookmark-buffer-url  |
| C-x r M | bookmark-current-url |
|---------+----------------------|

** Find

|---------+---------------------|
| binding | function            |
|---------+---------------------|
| f3      | search-buffer       |
| C-s s   | search-buffer       |
| C-s k   | remove-search-hints |
|---------+---------------------|

** Hints

|-------------+---------------------------------|
| binding     | function                        |
|-------------+---------------------------------|
| M-c h       | copy-hint-url                   |
| C-j         | follow-hint                     |
| C-J         | follow-hint-new-buffer          |
| C-u C-j     | follow-hint-new-buffer-focus    |
| C-u C-M-j   | follow-hint-nosave-buffer       |
| C-M-g C-M-g | follow-hint-nosave-buffer-focus |
|-------------+---------------------------------|

Via =emacs=

|-------------+---------------------------------|
| binding     | function                        |
|-------------+---------------------------------|
| C-x C-w     | copy-hint-url                   |
| M-g M-g     | follow-hint                     |
| C-u M-g g   | follow-hint-new-buffer          |
| C-u M-g M-g | follow-hint-new-buffer          |
| M-g g       | follow-hint-new-buffer-focus    |
| C-M-g g     | follow-hint-nosave-buffer       |
| C-M-j       | follow-hint-nosave-buffer-focus |
|-------------+---------------------------------|

** HTTP

|---------+---------------------------|
| binding | function                  |
|---------+---------------------------|
| C-l     | set-url                   |
| C-m o   | set-url-from-bookmark     |
| C-o     | open-file                 |
| C-O     | load-file                 |
| C-r     | reload-current-buffer     |
| C-u M-l | set-url-new-nosave-buffer |
| C-x r j | set-url-from-bookmark     |
| f5      | reload-current-buffer     |
| M-l     | set-url-new-buffer        |
|---------+---------------------------|

Via =emacs=

|---------+-----------|
| binding | function  |
|---------+-----------|
| C-x C-f | open-file |
|---------+-----------|

** Downloads

|---------+----------------|
| binding | function       |
|---------+----------------|
| C-d     | list-downloads |
| C-j     | list-downloads |
|---------+----------------|

** Buffers

|------------+------------------------|
| binding    | function               |
|------------+------------------------|
| C-/        | reopen-buffer          |
| C-[        | switch-buffer-previous |
| C-]        | switch-buffer-next     |
| C-`        | switch-buffer-last     |
| C-pagedown | switch-buffer-next     |
| C-pageup   | switch-buffer-previous |
| C-R        | reload-buffers         |
| C-s-t      | reopen-buffer          |
| C-s-tab    | switch-buffer-previous |
| C-t        | make-buffer-focus      |
| C-T        | reopen-buffer          |
| C-tab      | switch-buffer-next     |
| C-w        | delete-current-buffer  |
| M-down     | switch-buffer          |
|------------+------------------------|

Via =emacs=

|-----------+------------------------|
| binding   | function               |
|-----------+------------------------|
| C-x b     | switch-buffer          |
| C-x C-b   | list-buffers           |
| C-x C-k   | delete-current-buffer  |
| C-x k     | delete-buffer          |
| C-x left  | switch-buffer-previous |
| C-x right | switch-buffer-next     |
|-----------+------------------------|

** Windows

|---------+-----------------------|
| binding | function              |
|---------+-----------------------|
| C-n     | make-window           |
| C-s-W   | delete-current-window |
| C-W     | delete-current-window |
| M-w     | delete-window         |
|---------+-----------------------|

Via =emacs=

|---------+-----------------------|
| binding | function              |
|---------+-----------------------|
| C-x 5 0 | delete-current-window |
| C-x 5 1 | delete-window         |
| C-x 5 2 | make-window           |
|---------+-----------------------|

** Lisp

|-----------+--------------------------|
| binding   | function                 |
|-----------+--------------------------|
| M-x       | execute-command          |
| C-space   | execute-command          |
| C-M-x     | execute-extended-command |
| C-M-space | execute-extended-command |
| M-space   | resume-prompt            |
|-----------+--------------------------|
