cheatsheets/nyxt_cheatsheet.tex
% Created 2022-11-12 Sat 18:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{David Conner}
\date{\today}
\title{Nyxt\textsubscript{cheatsheet}}
\hypersetup{
 pdfauthor={David Conner},
 pdftitle={Nyxt\textsubscript{cheatsheet}},
 pdfkeywords={},
 pdfsubject={Lispy Cheatsheet},
 pdfcreator={Emacs 28.2.50 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Categories}
\label{sec:org069a2b6}
\begin{description}
\item[{Help}] describe functions/variables
\item[{Move}] movement in text, find/search
\item[{Edit}] copy/past
\item[{Present}] zoom
\item[{History}] 

\item[{Bookmarks}] 

\item[{Hints}] ???
\item[{HTTP}] open URL, go to URL bar
\item[{Downloads}] navigate downloads
\item[{Buffers}] search/open buffers
\item[{Windows}] frames really
\item[{Lisp}] commands, repl
\end{description}

\section{Keymaps}
\label{sec:org5ef2340}

\subsection{Application}
\label{sec:orgcee1bf9}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-g & nothing\\\empty
C-M-c & open-inspector\\\empty
C-M-Z & application-mode\\\empty
C-p & print-buffer\\\empty
C-q & quit\\\empty
C-x C-c & quit\\\empty
f11 & toggle-fullscreen\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Help}
\label{sec:orge23d619}

Via \texttt{C-h}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-h b & describe-bindings\\\empty
C-h C & describe-class\\\empty
C-h c & describe-command\\\empty
C-h C-h & help\\\empty
C-h f & describe-function\\\empty
C-h h & help\\\empty
C-h k & describe-key\\\empty
C-h r & manual\\\empty
C-h s & describe-slot\\\empty
C-h t & tutorial\\\empty
C-h v & describe-variable\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{F1}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
f1 b & describe-bindings\\\empty
f1 C & describe-class\\\empty
f1 c & describe-command\\\empty
f1 f & describe-function\\\empty
f1 f1 & help\\\empty
f1 k & describe-key\\\empty
f1 r & manual\\\empty
f1 s & describe-slot\\\empty
f1 t & tutorial\\\empty
f1 v & describe-variable\\\empty
\hline
\end{tabular}
\end{center}



\subsection{Move}
\label{sec:org430cfcb}

Via \texttt{C-<arrow>}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-up & scroll-to-top\\\empty
C-down & scroll-to-bottom\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{keypad}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
keypaddown & scroll-down\\\empty
keypadend & scroll-to-bottom\\\empty
keypadhome & scroll-to-top\\\empty
keypadleft & scroll-left\\\empty
keypadnext & scroll-page-down\\\empty
keypadpageup & scroll-page-up\\\empty
keypadprior & scroll-page-up\\\empty
keypadright & scroll-right\\\empty
keypadup & scroll-up\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-. & jump-to-heading\\\empty
C-n & scroll-down\\\empty
C-p & scroll-up\\\empty
C-v & scroll-page-down\\\empty
M-< & scroll-to-top\\\empty
M-> & scroll-to-bottom\\\empty
M-v & scroll-page-up\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Edit}
\label{sec:org1d2d692}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-i & autofill\\\empty
C-c & copy\\\empty
M-c t & copy-title\\\empty
M-c l & copy-url\\\empty
C-x & cut\\\empty
C-u C-o & edit-with-external-editor\\\empty
M-i & focus-first-input-field\\\empty
C-Z & redo\\\empty
C-a & select-all\\\empty
C-z & undo\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
M-w & copy\\\empty
C-M-i & copy-title\\\empty
C-M-l & copy-url\\\empty
C-w & cut\\\empty
C-u C-x C-f & edit-with-external-editor\\\empty
C-y & paste\\\empty
C-? & redo\\\empty
C-x h & select-all\\\empty
C-/ & undo\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Present}
\label{sec:org2612ad7}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-hyphen & unzoom-page\\\empty
C-button5 & unzoom-page\\\empty
C-+ & zoom-page\\\empty
C-= & zoom-page\\\empty
C-button4 & zoom-page\\\empty
C-0 & reset-page-zoom\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x C-+ & zoom-page\\\empty
C-x C-= & zoom-page\\\empty
C-x C-0 & reset-page-zoom\\\empty
C-x C-hyphen & unzoom-page\\\empty
\hline
\end{tabular}
\end{center}

\subsection{History}
\label{sec:orga2949a4}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-s-H & history-all-query\\\empty
C-s-h & history-all-query\\\empty
C-M-left & history-all-query\\\empty
M-[ & history-backwards\\\empty
M-left & history-backwards\\\empty
M-s-left & history-backwards-query\\\empty
M-] & history-forwards\\\empty
M-right & history-forwards\\\empty
button9 & history-forwards\\\empty
C-M-right & history-forwards-all-query\\\empty
M-s-right & history-forwards-query\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-M-b & history-all-query\\\empty
C-b & history-backwards\\\empty
button8 & history-backwards\\\empty
M-b & history-backwards-query\\\empty
C-f & history-forwards\\\empty
C-M-f & history-forwards-all-query\\\empty
M-f & history-forwards-query\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Bookmarks}
\label{sec:orgf2813d5}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-m C-s & bookmark-buffer-url\\\empty
C-m s & bookmark-current-url\\\empty
C-m g & bookmark-hint\\\empty
C-m u & bookmark-url\\\empty
C-m k & delete-bookmark\\\empty
C-b & list-bookmarks\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x r k & delete-bookmark\\\empty
C-x r u & bookmark-url\\\empty
C-x r m & bookmark-buffer-url\\\empty
C-x r M & bookmark-current-url\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Find}
\label{sec:org51f41f9}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
f3 & search-buffer\\\empty
C-s s & search-buffer\\\empty
C-s k & remove-search-hints\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Hints}
\label{sec:org16cc2a5}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
M-c h & copy-hint-url\\\empty
C-j & follow-hint\\\empty
C-J & follow-hint-new-buffer\\\empty
C-u C-j & follow-hint-new-buffer-focus\\\empty
C-u C-M-j & follow-hint-nosave-buffer\\\empty
C-M-g C-M-g & follow-hint-nosave-buffer-focus\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x C-w & copy-hint-url\\\empty
M-g M-g & follow-hint\\\empty
C-u M-g g & follow-hint-new-buffer\\\empty
C-u M-g M-g & follow-hint-new-buffer\\\empty
M-g g & follow-hint-new-buffer-focus\\\empty
C-M-g g & follow-hint-nosave-buffer\\\empty
C-M-j & follow-hint-nosave-buffer-focus\\\empty
\hline
\end{tabular}
\end{center}

\subsection{HTTP}
\label{sec:orgd442228}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-l & set-url\\\empty
C-m o & set-url-from-bookmark\\\empty
C-o & open-file\\\empty
C-O & load-file\\\empty
C-r & reload-current-buffer\\\empty
C-u M-l & set-url-new-nosave-buffer\\\empty
C-x r j & set-url-from-bookmark\\\empty
f5 & reload-current-buffer\\\empty
M-l & set-url-new-buffer\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x C-f & open-file\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Downloads}
\label{sec:org052f595}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-d & list-downloads\\\empty
C-j & list-downloads\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Buffers}
\label{sec:org9c9c661}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-/ & reopen-buffer\\\empty
C-[ & switch-buffer-previous\\\empty
C-] & switch-buffer-next\\\empty
C-` & switch-buffer-last\\\empty
C-pagedown & switch-buffer-next\\\empty
C-pageup & switch-buffer-previous\\\empty
C-R & reload-buffers\\\empty
C-s-t & reopen-buffer\\\empty
C-s-tab & switch-buffer-previous\\\empty
C-t & make-buffer-focus\\\empty
C-T & reopen-buffer\\\empty
C-tab & switch-buffer-next\\\empty
C-w & delete-current-buffer\\\empty
M-down & switch-buffer\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x b & switch-buffer\\\empty
C-x C-b & list-buffers\\\empty
C-x C-k & delete-current-buffer\\\empty
C-x k & delete-buffer\\\empty
C-x left & switch-buffer-previous\\\empty
C-x right & switch-buffer-next\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Windows}
\label{sec:orgdc2eac1}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-n & make-window\\\empty
C-s-W & delete-current-window\\\empty
C-W & delete-current-window\\\empty
M-w & delete-window\\\empty
\hline
\end{tabular}
\end{center}

Via \texttt{emacs}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
C-x 5 0 & delete-current-window\\\empty
C-x 5 1 & delete-window\\\empty
C-x 5 2 & make-window\\\empty
\hline
\end{tabular}
\end{center}

\subsection{Lisp}
\label{sec:org7c2a5ed}

\begin{center}
\begin{tabular}{ll}
\hline
binding & function\\\empty
\hline
M-x & execute-command\\\empty
C-space & execute-command\\\empty
C-M-x & execute-extended-command\\\empty
C-M-space & execute-extended-command\\\empty
M-space & resume-prompt\\\empty
\hline
\end{tabular}
\end{center}
\end{document}